Revit 2024 API
DirectShape.IsValidGeometry Method
 Validates geometry to be stored in a DirectShape. Suitable geometry validation is performed. Additionally, the geometry must make sense as a shape representation for the category assigned to this DirectShape object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsValidGeometry(
	Solid Geom
)
Visual Basic
Public Function IsValidGeometry ( _
	Geom As Solid _
) As Boolean
Visual C++
public:
bool IsValidGeometry(
	Solid^ Geom
)
Parameters
Geom
Type: Autodesk.Revit.DB.Solid
 GeometryObject to be validated.
Return Value
 True if the supplied GeometryObject passes the validation criteria.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShape Class
Autodesk.Revit.DB Namespace